#+TITLE: Example of a simple web app with express

** Scaffolding the app

#+BEGIN_SRC sh :results output
~/node_modules/express/bin/express
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
   create : .
   create : ./package.json
   create : ./app.js
   create : ./public
   create : ./public/javascripts
   create : ./public/images
   create : ./public/stylesheets
   create : ./public/stylesheets/style.css
   create : ./routes
   create : ./routes/index.js
   create : ./views
   create : ./views/layout.jade
   create : ./views/index.jade

   install dependencies:
     $ cd . && npm install

   run the app:
     $ node app
#+END_EXAMPLE

For this app, I want to customize things a bit and have a =controllers= folder,
instead of using the =routes= folder created when scaffolding the app.

#+BEGIN_SRC sh
mkdir controllers
rm -rf routes
#+END_SRC

** Installing the dependencies

A Node.js project includes its dependencies
along with the project under the =node_modules= directory.

#+BEGIN_SRC sh :results output
npm install
#+END_SRC

#+BEGIN_SRC sh
ls node_modules
#+END_SRC

#+RESULTS:
| consolidate |
| express     |
| mongojs     |
| swig        |

